{
  "projects": [
    {
      "visible": true,
      "title": " Twitter Showcase App",
      "description": "I developed a mock Twitter app to deepen my understanding of React, Flask, and API interactions, simulating Twitter's search functionality. This project enhanced my skills in building dynamic components, processing API data, and managing error handling. The use of Pythons Flask on the back end furthered my knowledge of multi-language application development, illustrating the seamless integration of different technologies to achieve a functional and educational outcome.",
      "image": {
        "src": "../../images/twitter-app-image.png",
        "alt": "Picture of mock Twitter app homepage",
        "linkTo": "https://twitter-showcase-2prb.onrender.com"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/nomoneyrecord/twitter-showcase-app.git"
        },
        {
          "type": "external",
          "url": "https://twitter-showcase-2prb.onrender.com"
        }
      ]
    },
    {
      "visible": true,
      "title": "Chat App",
      "description": "I engineered a full-stack, real-time chat application mirroring Slack's interactive experience, leveraging React and Socket.IO for the front end to establish a live, bidirectional communication channel. On the back end, Python, Flask, and SQL provide a solid infrastructure. My implementation of JSON Web Tokens (JWT) for secure authentication embodies a deep dive into token-based security mechanisms, while my use of Bootstrap showcases a commitment to responsive design. This project not only solidified my understanding of web sockets for real-time messaging among multiple concurrent users but also enhanced my proficiency in crafting connected, authenticated user experiences",
      "image": {
        "src": "../../images/chat-app-image.png",
        "alt": "Picture of Chat App homepage",
        "linkTo": "https://chat-app-2-965z.onrender.com"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/nomoneyrecord/chat-app.git"
        },
        {
          "type": "external",
          "url": "https://chat-app-2-965z.onrender.com"
        }
      ]
    },
    {
      "visible": true,
      "title": "Fantasy Stock Trading App",
      "description": "In my most advanced full-stack endeavor, I developed a stock trading simulator using React, Flask, SQL, and the Finnhub API, fine-tuning my skills from an intensive 16-month mentorship. The project emphasizes a scalable and secure backend architecture, DRY principles, and modular code for efficient maintenance. Complementing its robust functionality, the simulator features original, DALL·E-generated artwork that enhances the user interface with a distinctive design aesthetic.",
      "image": {
        "src": "../../images/fantasy-stock-trader-image.png",
        "alt": "Picture of Fantasy Stock Trading App",
        "linkTo": "https://fantasy-stock-trader.onrender.com"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/nomoneyrecord/fantasy-stock-trader.git"
        },
        {
          "type": "external",
          "url": "https://fantasy-stock-trader.onrender.com"
        }
      ]
    }
  ],
  "button": {
    "visible": true,
    "label": "Visit on Github",
    "url": "https://github.com/nomoneyrecord"
  }
}
